#+title: Hello Tokio

** Using ~async/await~
Async functions are called like any other Rust function.
However, calling these functions does not result in the function body executing.
Instead, calling an ~async fn~ =returns a value= representing the opration.
This is conceptually analogous to a zero-argument closure.
To actually run the operation, you should use the ~.await~ operator on the return value.

For example, the given program
#+begin_src rust
async fn say_world() {
    println!("world");
}

#[tokio::main]
async fn main(){
    // Calling `say_world()` does not execute the body of `say_world()`
    let op = say_world();

    // This println! comes first
    println!("hello");

    // Calling `.await` on `op` starts executing `say_world`.
    op.await;
}
#+end_src

#+RESULTS:
: hello
: world


The return value aof an ~async fn~ is an anonymous type taht implements the ~Future~ trait.

